## Project 2

In this project we will focus on tidying data to prepare it for analysis.

In [1]:
import pandas as pd

After importing pandas, we will read the following .csv files into DataFrame objects:

In [2]:
birthdays = pd.read_csv("C:/Users/cscam/birthdays.csv")
party_accessories = pd.read_csv("C:/Users/cscam/party_accessories.csv")
venues = pd.read_csv("C:/Users/cscam/venue.csv")

The three datasets are part of a party planning database and contain children's birthdays, optional venues, and accessories that need to be ordered.

In [4]:
birthdays

    Name           Birthday      Favorite Dessert
0  Peter          1/28/2014        chocolate cake
1   Jane          5/14/2017      vanilla cupcakes
2   Mary  September 5, 2015  strawberry ice cream

In [29]:
party_accessories

            Item  Quantity     Color
0   red balloons       5.0       NaN
1      streamers      10.0    silver
2     10 candles       NaN  assorted
3            NaN       NaN       NaN
4            NaN       NaN       NaN
5            NaN       NaN       NaN
6            NaN       NaN       NaN
7            NaN       NaN       NaN
8            NaN       NaN       NaN
9            NaN       NaN       NaN
10           NaN       NaN       NaN
11           NaN       NaN       NaN
12           NaN       NaN       NaN
13           NaN       NaN       NaN
14           NaN       NaN       NaN
15           NaN       NaN       NaN
16           NaN       NaN       NaN
17           NaN       NaN       NaN

In [7]:
venues

        Venue          Size    Price
0  Wild World  4000 sq. ft.  $1,000
1    Fun Zone     40' x 60'    $800
2  Party Plus  3000 sq. ft.    $900

As we can see, there are a number of issues that prevent us from performing useful analysis on the data. Let's begin with the **birthdays** dataFrame.

There are two things that can be fixed here:

In [79]:
#match formatting of dates in the birthdays column:
tidy_birthdays = birthdays.replace({'Birthday':'1/28/2014'}, 'January 28, 2014')
tidy_birthdays = tidy_birthdays.replace({'Birthday':'5/14/2017'}, 'May 14, 2017')

#separate values in the 'favorite dessert' column by adding an additional column for favorite flavor:
favorite_flavors = ['chocolate', 'vanilla', 'strawberry']
favorite_dessert = ['cake', 'cupcakes', 'ice cream']
tidy_birthdays['Favorite Flavor'] = favorite_flavors
tidy_birthdays['Favorite Dessert'] = favorite_dessert
tidy_birthdays

    Name           Birthday Favorite Dessert Favorite Flavor
0  Peter   January 28, 2014             cake       chocolate
1   Jane       May 14, 2017         cupcakes         vanilla
2   Mary  September 5, 2015        ice cream      strawberry

Now let's look at the **party accessories** dataFrame:

In [81]:
#separate values in the 'item' column and fill in NaN fields:
tidy_accessories = party_accessories.replace({'Item':'red balloons'}, 'balloons')
tidy_accessories['Color'].fillna('red', limit=1, inplace=True)
tidy_accessories = tidy_accessories.replace({'Item':'10 candles'}, 'candles')
tidy_accessories['Quantity'].fillna(10, limit=1, inplace=True)

#remove rows 3-17:
tidy_accessories.dropna(inplace=True)
tidy_accessories

        Item  Quantity     Color
0   balloons       5.0       red
1  streamers      10.0    silver
2    candles      10.0  assorted

Finally, we need to tidy up the **venues** dataFrame:

In [86]:
#match units of measure in the 'size' column:
fun_zone_sqft = (40 * 60)
tidy_venues = venues.replace({'Size':"40' x 60'"}, (f"{fun_zone_sqft}  sq. ft."))
tidy_venues

        Venue           Size    Price
0  Wild World   4000 sq. ft.  $1,000
1    Fun Zone  2400  sq. ft.    $800
2  Party Plus   3000 sq. ft.    $900

We now have three tidy datasets that can be used for planning children's birthdays. We can easily check dates, determine the best dessert to order, and compare prices for venues based on a common unit of measure.